/***************************************************************************************
                                                                                        
        *          .               *                              .               *     
        ███████╗██╗  ██╗██╗   ██╗        ██████╗  ██████╗  ██████╗         *            
        ██╔════╝██║ ██╔╝╚██╗ ██╔╝        ██╔══██╗██╔═══██╗██╔════╝                      
        ███████╗█████╔╝  ╚████╔╝         ██║  ██║██║   ██║██║  ███╗        .            
        ╚════██║██╔═██╗   ╚██╔╝          ██║  ██║██║   ██║██║   ██║                     
        ███████║██║  ██╗    ██║           ██████╔╝╚██████╔╝╚██████╔╝         *          
        ╚══════╝╚═╝  ╚═╝    ╚═╝           ╚═════╝  ╚═════╝  ╚═════╝                     
                                                                                        
        <~~~               .        SKY Dog Game                      ~~~>        *     
                                Real-Time | Cross-Platform           .                  
----------------------------------------------------------------------------------------
                                                                                        
                                  ,,                                                    
                  __           o-°°|\_____/)                                            
    Author:   (___()'`; Zee...  \_/|_)     )                                            
              /,    /`             \  __  /                                             
              \\"--\\              (_/ (_/                                              
    Created:  9/08/26  @  10:31 PM
    FileName: TextureDataType.hpp @ RedSoUL Project
    History:
             - created by: 9/08/26: Zenggang LIU
                                                                                        
***************************************************************************************/


#pragma once


/// System headers
#include <stdint.h> /// uint8_t


/// Render texture(渲染贴图)数据类型
///
enum class TextureDataType : uint8_t
{
    // === 非压缩数据类型 === //
    /// Ldr Rgba 四通道彩色贴图: 保存为LdrColor
    LDR_RGBA_TEXTURE,
    /// Ldr 单通道灰度贴图: 保存为uint16_t
    LDR_GRAYSCALE_TEXTURE,
    /// Hdr Rgba 四通道彩色贴图: 保存为HdrColor
    HALF_RGBA_TEXTURE,
};
