/***************************************************************************************
                                                                                        
        *          .               *                              .               *     
        ███████╗██╗  ██╗██╗   ██╗        ██████╗  ██████╗  ██████╗         *            
        ██╔════╝██║ ██╔╝╚██╗ ██╔╝        ██╔══██╗██╔═══██╗██╔════╝                      
        ███████╗█████╔╝  ╚████╔╝         ██║  ██║██║   ██║██║  ███╗        .            
        ╚════██║██╔═██╗   ╚██╔╝          ██║  ██║██║   ██║██║   ██║                     
        ███████║██║  ██╗    ██║           ██████╔╝╚██████╔╝╚██████╔╝         *          
        ╚══════╝╚═╝  ╚═╝    ╚═╝           ╚═════╝  ╚═════╝  ╚═════╝                     
                                                                                        
        <~~~               .        SKY Dog Game                      ~~~>        *     
                                Real-Time | Cross-Platform           .                  
----------------------------------------------------------------------------------------
                                                                                        
                                  ,,                                                    
                  __           o-°°|\_____/)                                            
    Author:   (___()'`; Zee...  \_/|_)     )                                            
              /,    /`             \  __  /                                             
              \\"--\\              (_/ (_/                                              
    Created:  3/04/26  @  9:30 PM
    FileName: RenderMeshDataType.hpp @ RedSoUL Project
    History:
             - created by: 3/04/26: Zenggang LIU
                                                                                        
***************************************************************************************/


#pragma once


/// System headers
#include <stdint.h> /// uint16_t


/// Render mesh 顶点数据类型
///
/// 类型定义数值分布:
/// +-----------+-----------+---------+------+----------+------------+
/// | (4 BONES) | (2 BONES) | (COLOR) | (UV) | (NORMAL) | (POSITION) |
/// +-----------+-----------+---------+------+----------+------------+
///
enum VertexDataType : uint16_t
{
    UNKNOWN_VERTEX_DATA_TYPE = 0,

    /// 位置数据: float_3
    POSITION_DATA   = 1 << 0,
    /// 法线数据: float_2: (x, y)
    NORMAL_DATA     = 1 << 1,
    /// 纹理坐标数据: float_2
    TEXCOORD_DATA   = 1 << 2,
    /// 色彩数据: float_3
    COLOR_DATA      = 1 << 3,
    /// 两根骨骼数据: (骨骼0索引, 骨骼1索引 | 骨骼0权重, 骨骼1权重)
    /// (uint32_t, packed_float_4)
    /// NOTE: 骨骼索引使用32位整数存储(最多支持256根骨骼)
    TWO_BONES_DATA  = 1 << 4,
    /// 四根骨骼索引/权重数据:
    /// (骨骼0索引, 骨骼1索引, 骨骼2索引, 骨骼3索引,| 骨骼0权重, 骨骼1权重, 骨骼2权重, 骨骼3权重)
    /// (uint32_t, packed_float_4)
    /// NOTE: 骨骼索引使用32位整数存储(最多支持256根骨骼)
    FOUR_BONES_DATA = 1 << 5,
};
