/***************************************************************************************
                                                                                        
        *          .               *                              .               *     
        ███████╗██╗  ██╗██╗   ██╗        ██████╗  ██████╗  ██████╗         *            
        ██╔════╝██║ ██╔╝╚██╗ ██╔╝        ██╔══██╗██╔═══██╗██╔════╝                      
        ███████╗█████╔╝  ╚████╔╝         ██║  ██║██║   ██║██║  ███╗        .            
        ╚════██║██╔═██╗   ╚██╔╝          ██║  ██║██║   ██║██║   ██║                     
        ███████║██║  ██╗    ██║           ██████╔╝╚██████╔╝╚██████╔╝         *          
        ╚══════╝╚═╝  ╚═╝    ╚═╝           ╚═════╝  ╚═════╝  ╚═════╝                     
                                                                                        
        <~~~               .        SKY Dog Game                      ~~~>        *     
                                Real-Time | Cross-Platform           .                  
----------------------------------------------------------------------------------------
                                                                                        
                                  ,,                                                    
                  __           o-°°|\_____/)                                            
    Author:   (___()'`; Zee...  \_/|_)     )                                            
              /,    /`             \  __  /                                             
              \\"--\\              (_/ (_/                                              
    Created:  3/06/26  @  5:14 PM
    FileName: TransformType.hpp @ RedSoUL Project
    History:
             - created by: 3/06/26: Zenggang LIU
                                                                                        
***************************************************************************************/


#pragma once

/// System headers
#include <stdint.h> /// uint16_t,...


/// 本地变换类型
enum class TransformType : uint16_t
{
    IDENTITY_TRANSFROM = 0,

    HAS_POSITION = 1 << 0,
    HAS_ROTATION = 1 << 1,
    HAS_SCALING  = 1 << 2,

    IS_UNIFORM_SCALING  = 1 << 8, /// 只有HAS_SCALING设置时才有效

    /// 禁止任何变换(STATIC SCENE OBJECT)
    IS_TRANSFORM_FROZEN = 2 << 8,
};
