/***************************************************************************************
                                                                                        
        *          .               *                              .               *     
        ███████╗██╗  ██╗██╗   ██╗        ██████╗  ██████╗  ██████╗         *            
        ██╔════╝██║ ██╔╝╚██╗ ██╔╝        ██╔══██╗██╔═══██╗██╔════╝                      
        ███████╗█████╔╝  ╚████╔╝         ██║  ██║██║   ██║██║  ███╗        .            
        ╚════██║██╔═██╗   ╚██╔╝          ██║  ██║██║   ██║██║   ██║                     
        ███████║██║  ██╗    ██║           ██████╔╝╚██████╔╝╚██████╔╝         *          
        ╚══════╝╚═╝  ╚═╝    ╚═╝           ╚═════╝  ╚═════╝  ╚═════╝                     
                                                                                        
        <~~~               .        SKY Dog Game                      ~~~>        *     
                                Real-Time | Cross-Platform           .                  
----------------------------------------------------------------------------------------
                                                                                        
                                  ,,                                                    
                  __           o-°°|\_____/)                                            
    Author:   (___()'`; Zee...  \_/|_)     )                                            
              /,    /`             \  __  /                                             
              \\"--\\              (_/ (_/                                              
    Created:  29/03/26  @  12:54 PM
    FileName: Ray3D.hpp @ RedSoUL Project
    History:
             - created by: 29/03/26: Zenggang LIU
                                                                                        
***************************************************************************************/


#pragma once


/// Library headers
#include "DataType/Float3D.hpp"


/// 三维射线
/// - 定义为: Ray(t) := O + t*D, t为任意数值[-oo, +oo]
///
struct Ray3D
{
    /// 起始点O
    float_3 org;
    /// 非归一化方向向量D
    float_3 dir;

    /// 创建一个从起始点S指向目标点T的三维射线
    static
    Ray3D
    make (
        const float_3 start,
        const float_3 target);

    /// 计算时间为T处的点
    float_3
    calc_point (
        const float time) const;
};
