/***************************************************************************************
                                                                                        
        *          .               *                              .               *     
        ███████╗██╗  ██╗██╗   ██╗        ██████╗  ██████╗  ██████╗         *            
        ██╔════╝██║ ██╔╝╚██╗ ██╔╝        ██╔══██╗██╔═══██╗██╔════╝                      
        ███████╗█████╔╝  ╚████╔╝         ██║  ██║██║   ██║██║  ███╗        .            
        ╚════██║██╔═██╗   ╚██╔╝          ██║  ██║██║   ██║██║   ██║                     
        ███████║██║  ██╗    ██║           ██████╔╝╚██████╔╝╚██████╔╝         *          
        ╚══════╝╚═╝  ╚═╝    ╚═╝           ╚═════╝  ╚═════╝  ╚═════╝                     
                                                                                        
        <~~~               .        SKY Dog Game                      ~~~>        *     
                                Real-Time | Cross-Platform           .                  
----------------------------------------------------------------------------------------
                                                                                        
                                  ,,                                                    
                  __           o-°°|\_____/)                                            
    Author:   (___()'`; Zee...  \_/|_)     )                                            
              /,    /`             \  __  /                                             
              \\"--\\              (_/ (_/                                              
    Created:  29/03/26  @  12:50 PM
    FileName: Triangle3D.hpp @ RedSoUL Project
    History:
             - created by: 29/03/26: Zenggang LIU
                                                                                        
***************************************************************************************/


#pragma once


/// Library Headers
#include "Collision/Ray3D.hpp"
#include "DataType/Float3D.hpp"


/// 三维三角面
///
struct Triangle3D
{
    /// 三角面的三个顶点依次为A, B, C
    /// 它的法线定义为 N := Cross(AB, AC)
    ///        B
    ///        /\
    ///       /  \  / 法线N
    ///      /    \/
    ///     /     /\
    ///    /     /  \
    ///   /     /    \
    ///  /            \
    /// A ------------- C
    ///
    float_3 a;
    float_3 b;
    float_3 c;

    /// 创建一个底边长为1的等腰三角形
    ///
    ///              y
    ///              ^
    ///              |
    ///              B (0, 0.5, 0)
    ///             /|\
    ///            / | \
    ///           /  |  \
    ///          /   |   \
    ///       --/----O----\----> x
    ///        /     |     \
    ///       /      |      \
    ///      A ------+------- C
    /// (-0.5, -0.5, 0)   (0.5, -0.5, 0)
    static
    Triangle3D
    make ();

    /// 计算指定射线与当前三角面相交点的Hit Time
    ///
    /// @param[in]  local_ray
    ///     检测用的射线(NOTE: 必须在当前三角面的本地坐标系内)
    /// @return
    ///     返回Hit Time
    ///     负数: 如不相交
    ///     正数: 如果相交
    float
    calc_hit_time (
        const Ray3D local_ray) const;
};
