/***************************************************************************************
                                                                                        
        *          .               *                              .               *     
        ███████╗██╗  ██╗██╗   ██╗        ██████╗  ██████╗  ██████╗         *            
        ██╔════╝██║ ██╔╝╚██╗ ██╔╝        ██╔══██╗██╔═══██╗██╔════╝                      
        ███████╗█████╔╝  ╚████╔╝         ██║  ██║██║   ██║██║  ███╗        .            
        ╚════██║██╔═██╗   ╚██╔╝          ██║  ██║██║   ██║██║   ██║                     
        ███████║██║  ██╗    ██║           ██████╔╝╚██████╔╝╚██████╔╝         *          
        ╚══════╝╚═╝  ╚═╝    ╚═╝           ╚═════╝  ╚═════╝  ╚═════╝                     
                                                                                        
        <~~~               .        SKY Dog Game                      ~~~>        *     
                                Real-Time | Cross-Platform           .                  
----------------------------------------------------------------------------------------
                                                                                        
                                  ,,                                                    
                  __           o-°°|\_____/)                                            
    Author:   (___()'`; Zee...  \_/|_)     )                                            
              /,    /`             \  __  /                                             
              \\"--\\              (_/ (_/                                              
    Created:  15/05/26  @  10:49 PM
    FileName: BitOperationUtilities.hpp @ RedSoUL Project
    History:
             - created by: 15/05/26: Zenggang LIU
                                                                                        
***************************************************************************************/


#pragma once


/// System headers
#include <stdint.h> /// uint8_t,...


/// 表示数据为0
#define NO_SETBIT_AT_ALL ((uint8_t)(-1))


struct BitOperationUtility
{
    /// 从最低位开始, 寻找指定整数中第一个设置为1的位置(最低位为0)
    /// LSB --> MSB
    /// 0   --> 63
    ///
    /// @param[in]   data
    ///      64位整数
    /// @return
    ///      zero-based的位置,  如果此整数不为0
    ///      NO_SETBIT_AT_ALL, 如果此整数为0
    static
    uint8_t
    bit_scan_forward64 (
        const uint64_t data);
};
